app/controllers/admin/galleries_controller.rb

  def show
    @gallery = Gallery.find_by_id(params[:id])
    @uploads = @gallery.uploads.find(:all,:order => "position")
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = '10') LIMIT 1
SELECT * FROM `uploads` WHERE (`uploads`.gallery_id = 10) ORDER BY position

  def new
    @property = Property.find_by_id(params[:property_id])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = '3') LIMIT 1

  def create
    @gallery = Gallery.new params[:gallery]
       if @gallery.save
---
INSERT INTO `galleries` (`updated_at`, `title`, `property_id`, `description`, `created_at`) VALUES('2009-11-11 13:14:41', 'test', 3, NULL, '2009-11-11 13:14:41')

  def destroy
    @gallery = Gallery.find_by_id(params[:id])
    @gallery.destroy
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = '10') LIMIT 1
DELETE FROM `galleries` WHERE `id` = 10

  def prioritize_uploads
    gallery = Gallery.find(params[:id])
    uploads = gallery.uploads
    uploads.each do |upload|
      upload.position = params['image'].index(upload.id.to_s) + 1
      upload.save
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 13)
SELECT * FROM `uploads` WHERE (`uploads`.gallery_id = 13)
UPDATE `uploads` SET `position` = 2, `updated_at` = '2009-11-13 12:38:14' WHERE `id` = 41