app/controllers/admin/metatag_controller.rb

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
---
  def index
    @pages = Page.find(:all)