app/controllers/admin/overview_controller.rb

  def index
    @pages = Page.find(:all)
    @categories = Category.find_main
    @countries = Country.find(:all)
---
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `categories` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `countries` WHERE (`countries`.`id` IN (11,12,13,9))