app/controllers/admin/pages_controller.rb

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `pages`
---
  def index
     @pagetitle = "Admin - Static pages"

		if params[:parent]
			@parent = Page.find_by_id(params[:parent])
			@pages = Page.find_sub(params[:parent])
		else
			@pages = Page.find_main

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
---
   def show
     @page = Page.find(params[:id])

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
---
   def edit
     @page = Page.find(params[:id])

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
UPDATE `pages` SET `thumb_content_type` = 'image/jpeg', `thumb_updated_at` = '2009-11-16 15:16:06', `thumb_file_size` = 1675407, `thumb_file_name` = 'Hogan-Theatre-01.jpg', `updated_at` = '2009-11-16 15:16:09' WHERE `id` = 1
---
   def update
     @page = Page.find(params[:id])
     respond_to do |format|
       if @page.update_attributes(params[:page])

INSERT INTO `page_featured_photos` (`content_type`, `size`, `thumbnail`, `updated_at`, `page_id`, `filename`, `height`, `parent_id`, `width`, `created_at`) VALUES('image/jpeg', 1675407, NULL, '2009-11-16 15:26:41', 1, 'Hogan-Theatre-01.jpg', 359, NULL, 961, '2009-11-16 15:26:41')
---
  def update_page_featured
    @page_featured_photo = PageFeaturedPhoto.new(params[:page_featured_photo])
      if @page_featured_photo.save