app/controllers/admin/properties_controller.rb

SELECT * FROM `locations` WHERE (county='Orange')
---
  def index
    @locations = Location.find(:all)

SELECT * FROM `properties` WHERE (`properties`.`id` = '3') LIMIT 1
---
  def show
    @property = Property.find_by_id(params[:id])