app/controllers/admin/services_controller.rb

SELECT * FROM `categories` WHERE (parent_id IS NULL) ORDER BY position
---
  def index
    @categories = Category.find_main