app/controllers/admin/uploads_controller.rb

SELECT * FROM `uploads` WHERE (`uploads`.`id` = '40') LIMIT 1
---
  def edit
    @upload = Upload.find_by_id(params[:id])

SELECT * FROM `uploads` WHERE (`uploads`.`id` = '40') LIMIT 1
UPDATE `uploads` SET `title` = '', `updated_at` = '2009-11-11 13:16:05' WHERE `id` = 40
---
  def update
    @upload = Upload.find_by_id(params[:id])
      if @upload.update_attributes params[:upload]