app/controllers/blog_controller.rb

  def index
	 @page = Page.find_by_name('blog')

		@subpages = @page.subpages
	  @posts = Post.find_all_sub
		@posts =	@posts.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM `pages` WHERE (`pages`.`name` = 'blog') LIMIT 1
SELECT * FROM `posts` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 26)