app/controllers/blog_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 22)
---
  def index
	 @page = Page.find_by_name('blog')
   @posts = Post.find(:all)