app/controllers/contact_controller.rb

	def zillow_homevalue
		require 'rillow'
		@location = Location.find_by_id(params[:id])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = '15') LIMIT 1

	def zillow_demographics
		require 'rillow'
		@location = Location.find_by_id(15)
---
SELECT * FROM `locations` WHERE (`locations`.`id` IS NULL) LIMIT 1