app/controllers/properties_controller.rb

  def index
    #@properties = Property.find(:all,:order => 'created_at')
	  #@search_query = SearchQuery.find_by_id(156)
		#pickup_properties(@search_query.id)

		@properties = Property.find(:all, :conditions => ["location_id = ?",15] )
    #@properties.sort!{|x| x.featured }
		#@properties.sort!{|x| x.featured == true }
		logger.info "Filter #{params[:filter]}\n Order #{params[:order]}"
	case params[:filter]
			when "rent"
			@properties.delete_if {|x| x.rental == false }
			when "buy"
			@properties.delete_if {|x| x.rental == true }
			when "featured"
			@properties.delete_if {|x| x.featured == false }
		end
		if params[:order]=="des"
			@properties.sort!{|y,x| x.price <=> y.price}
			@order = "asc"
		else
			@properties.sort!{|x,y| x.price <=> y.price}
			@order = "des"
		end
	  @properties.delete_if {|x| x.validated == false }
		@properties = @properties.paginate :page => params[:page], :per_page => 10
		 @page = Page.find_by_name('properties')
---
SELECT * FROM `properties` WHERE (location_id = 15)
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `properties` ORDER BY bedrooms
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 4)
SELECT count(*) AS count_all FROM `properties` WHERE (`properties`.location_id = 11)
SELECT * FROM `pages` WHERE (`pages`.`name` = 'properties') LIMIT 1

  def show
		if params[:title]
			@title = params[:title].gsub(/-/," ")
			@property = Property.find_by_title(@title)
  	  @page = Page.find_by_name('properties')
---
SELECT * FROM `properties` WHERE (`properties`.`title` = '110 Via Quito') LIMIT 1
SELECT * FROM `pages` WHERE (`pages`.`name` = 'properties') LIMIT 1

  def feed_images
     @property = Property.find_by_id(params[:id])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = '28') LIMIT 1

  def search
  #  @properties = []
    @page = Page.find_by_name('properties')
    @subpages = @page.subpages
		if params[:regional]=="true"
			@region = params[:region].gsub(/-/," ")
			@location = Location.find_by_region(@region)
			@properties = @location.properties
		else
	    @search_query = SearchQuery.new(params[:search_query])
	    @search_query.save
		 pickup_properties(@search_query.id)
		end
	case params[:filter]
			when "rent"
			@properties.delete_if {|x| x.rental == false }
			when "buy"
			@properties.delete_if {|x| x.rental == true }
			when "featured"
			@properties.delete_if {|x| x.featured == false }
		end
		if params[:order]=="des"
			@properties.sort!{|y,x| x.price <=> y.price}
			@order = "asc"
		else
			@properties.sort!{|x,y| x.price <=> y.price}
			@order = "des"
		end
		@properties = @properties.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM `pages` WHERE (`pages`.`name` = 'properties') LIMIT 1
SELECT * FROM `locations` WHERE (region = 'Santa Monica')
INSERT INTO `search_queries` (`region`, `buy_rent`, `price`, `bedrooms`, `zip`, `created_at`, `country`, `updated_at`, `states`, `area`, `mls`, `query`) VALUES('Los Angeles - Orange County', 'All', 'All', 'All', '', '2010-04-03 20:37:39', 'United States', '2010-04-03 20:37:39', 'California', 'All', NULL, NULL)
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `properties` WHERE (`properties`.location_id = 11)
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 4)
SELECT count(*) AS count_all FROM `properties` WHERE (`properties`.location_id = 11)