app/controllers/properties_controller.rb

  def index

     @properties = Property.find(:all, :include => 'location',:order => 'locations.region')
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 15)

  def show

    @property = Property.find_by_id(params[:id])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = '28') LIMIT 1