app/controllers/rss_controller.rb

  def favs
     @favs = Page.find(:all, :conditions=>['featured=?',true])
---
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position

  def about
       @list = Country.find(:all)

		for c in @list
			@locations = c.locations
			@locations.delete_if{|s| s.properties.size == 0}
		end
		@list.delete_if{|z| z.locations.size == 0}
---
SELECT * FROM `countries` WHERE (`countries`.`id` IN (11,12,13,9))
SELECT * FROM `locations` WHERE (`locations`.country_id = 9)
SELECT * FROM `properties` ORDER BY bedrooms
SELECT count(*) AS count_all FROM `locations` WHERE (`locations`.country_id = 9)
SELECT count(*) AS count_all FROM `properties` WHERE (`properties`.location_id = 11)
SELECT * FROM `countries`

	def similar
		@property = Property.find_by_id(params[:id])
		@properties = Property.find(:all, :conditions =>['bedrooms = ?',@property.bedrooms])
		@properties.delete_if{|qqq| qqq.id == @property.id}
		if @properties.length == 0
---
SELECT * FROM `properties` WHERE (location_id = 15 and bedrooms = 1)
SELECT * FROM `properties` WHERE (bedrooms = 1)
SELECT * FROM `properties` ORDER BY bedrooms
SELECT count(*) AS count_all FROM `properties` WHERE (`properties`.location_id = 11)