app/controllers/rss_controller.rb

  def about
       @list = Page.find(:all, :conditions=>['parent_id=?',10])
---
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position