app/controllers/services_controller.rb

  def index
    @page = Page.find_by_name('services')
    @subpages = @page.subpages
    @categories = Category.find_main
---
SELECT * FROM `pages` WHERE (`pages`.`name` = 'services') LIMIT 1
SELECT * FROM `categories` WHERE (parent_id IS NULL) ORDER BY position

  def show
    @page = Page.find_by_name('services')

    if params[:subcategory] == nil
      @category = Category.find_by_name(params[:id])
    else
      @category = Category.find_by_name(params[:subcategory])
    end
    @categories = Category.find_main
---
SELECT * FROM `pages` WHERE (`pages`.`name` = 'services') LIMIT 1
SELECT * FROM `categories` WHERE (`categories`.`name` = 'concierge') LIMIT 1
SELECT * FROM `categories` WHERE (parent_id IS NULL) ORDER BY position