app/controllers/viewer_controller.rb

  def show
    @page = Page.find_by_name(params[:name])
---
SELECT * FROM `pages` WHERE (`pages`.`name` = 'home') LIMIT 1

		end

		if @page.name == "home"
			@posts = Post.find_sub(4)
---
SELECT * FROM `posts` WHERE (parent_id > 0) ORDER BY date DESC